# 11/7

In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

def exam_data_load(df, target, id_name="", null_name=""):
    if id_name == "":
        df = df.reset_index().rename(columns={"index": "id"})
        id_name = 'id'
    else:
        id_name = id_name
    
    if null_name != "":
        df[df == null_name] = np.nan
    
    X_train, X_test = train_test_split(df, test_size=0.2, random_state=2021)
    
    y_train = X_train[[id_name, target]]
    X_train = X_train.drop(columns=[target])

    
    y_test = X_test[[id_name, target]]
    X_test = X_test.drop(columns=[target])
    return X_train, X_test, y_train, y_test 
    
df = pd.read_csv("C:/Users/SuperUser/Desktop/train.csv")
X_train, X_test, y_train, y_test = exam_data_load(df, target='Survived', id_name='PassengerId')

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((712, 11), (179, 11), (712, 2), (179, 2))

In [3]:
import pandas as pd

In [4]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
90,91,3,"Christmann, Mr. Emil",male,29.0,0,0,343276,8.0500,NaN,S
103,104,3,"Johansson, Mr. Gustaf Joel",male,33.0,0,0,7540,8.6542,NaN,S
577,578,1,"Silvey, Mrs. William Baird (Alice Munger)",female,39.0,1,0,13507,55.9000,E44,S
215,216,1,"Newell, Miss. Madeleine",female,31.0,1,0,35273,113.2750,D36,C
191,192,2,"Carbines, Mr. William",male,19.0,0,0,28424,13.0000,NaN,S

In [5]:
X_train.isnull().sum() #결측치 확인

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            137
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          542
Embarked         1
dtype: int64

In [6]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
210,211,3,"Ali, Mr. Ahmed",male,24.0,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S
876,877,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
666,667,2,"Butler, Mr. Reginald Fenton",male,25.0,0,0,234686,13.0000,NaN,S
819,820,3,"Skoog, Master. Karl Thorsten",male,10.0,3,2,347088,27.9000,NaN,S
736,737,3,"Ford, Mrs. Edward (Margaret Ann Watson)",female,48.0,1,3,W./C. 6608,34.3750,NaN,S

In [8]:
y_test.head()

     PassengerId  Survived
210          211         0
876          877         0
666          667         0
819          820         0
736          737         0

In [10]:
y_train['Survived'].value_counts()

0    441
1    271
Name: Survived, dtype: int64

In [13]:
y=y_train['Survived']

features=['Pclass',"Sex","SibSp","Parch"]
X=pd.get_dummies(X_train[features])
test=pd.get_dummies(X_test[features])

In [28]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators=200, max_depth=7,random_state=2000)
model.fit(X,y)
predict=model.predict(test)

In [29]:
model.score(X,y)

0.8356741573033708

In [20]:
output=pd.DataFrame({'PassengerId': X_test.PassengerId,'Survived': predict})
output.head()

     PassengerId  Survived
210          211         0
876          877         0
666          667         0
819          820         0
736          737         0

In [21]:
output.to_csv("123456.csv",index=False)

# 작업형 1

In [30]:
import pandas as pd

In [32]:
data=pd.read_csv("C:/Users/SuperUser/Desktop/data/basic1.csv")

In [36]:
tmp = data.groupby(['city','f4'])[['f5']].mean()

In [38]:
tmp=tmp.reset_index().sort_values('f5',ascending=False).head(7)

In [39]:
tmp

   city    f4         f5
36   서울  ENFP  98.429899
2    경기  ESFJ  97.381034
44   서울  INTJ  91.297791
41   서울  ESTP  91.297791
47   서울  ISFP  91.057640
7    경기  INFP  90.531801
42   서울  INFJ  83.685380

In [40]:
round(tmp['f5'].sum(),2)

643.68

In [41]:
data=pd.read_csv("C:/Users/SuperUser/Desktop/data/basic1.csv")

In [44]:
tmp = data.sort_values('age',ascending=False).head(20)

In [46]:
tmp.isnull().sum()

id       0
age      0
city     0
f1       8
f2       0
f3      20
f4       0
f5       0
dtype: int64

In [47]:
tmp['f1']=tmp['f1'].fillna(tmp['f1'].median())

In [48]:
tmp['f1'].isnull().sum()

0

In [49]:
tmp[(tmp['f4']=='ISFJ') & (tmp['f5']>=20)]['f1'].mean()

73.875

In [50]:
data=pd.read_csv("C:/Users/SuperUser/Desktop/data/basic1.csv")

In [60]:
tmp=data[data['f2']==0]

In [61]:
tmp= tmp.sort_values('age').head(20)

In [62]:
tmp.isnull().sum()

id       0
age      0
city     0
f1       9
f2       0
f3      18
f4       0
f5       0
dtype: int64

In [63]:
a = tmp['f1'].var() # 결측치 체우기 전 f1 분산값

In [64]:
tmp['f1']=tmp['f1'].fillna(tmp['f1'].min())

In [65]:
b = tmp['f1'].var() #결측치 채운 후 f1분산값

In [66]:
round(a-b,2)

38.44

In [67]:
import pandas as pd

In [68]:
data = pd.read_csv("C:/Users/SuperUser/Desktop/data/basic2.csv")

In [69]:
data.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    object
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 28.6+ KB

In [84]:
data[("2022-05-01"<=data['Date'])&(data['Date']<="2022-05-31")]['Sales'].median()

1477685.0

In [85]:
# 정식 풀이
data['Date']=pd.to_datetime(data['Date'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [86]:
data['year']=data['Date'].dt.year
data['month']=data['Date'].dt.month
data['day']=data['Date'].dt.day

In [88]:
data.head()

        Date     Sales      PV      UV  Events  year  month  day
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1
1 2022-01-02     36779    3969  2289.0       0  2022      1    2
2 2022-01-03  13943875  373890     NaN       1  2022      1    3
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374  190684     NaN       0  2022      1    5

In [89]:
test=(data['year']==2022)&(data['month']==5)
print(data[test]['Sales'].median())

1477685.0

In [90]:
data = pd.read_csv("C:/Users/SuperUser/Desktop/data/basic2.csv")

In [93]:
data['Date']=pd.to_datetime(data['Date'])

In [94]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [105]:
data['year'] = data['Date'].dt.year
data['month']=data['Date'].dt.month
data['day'] = data['Date'].dt.day
data['weekday']= data['Date'].dt.weekday

In [121]:
data.head()

        Date     Sales      PV      UV  Events  year  month  day  weekday
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1        5
1 2022-01-02     36779    3969  2289.0       0  2022      1    2        6
2 2022-01-03  13943875  373890     NaN       1  2022      1    3        0
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4        1
4 2022-01-05   2395374  190684     NaN       0  2022      1    5        2

In [122]:
data['dayofweek']=data['weekday'].apply(lambda x: x>=5,1,0)

In [123]:
data.head()

,Date,Sales,PV,UV,Events,year,month,day,weekday,dayofweek
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False

In [128]:
tmp_a = (data['year']==2022)&(data['month']==5)&(data['dayofweek']==True)

In [129]:
tmp_b = (data['year']==2022)&(data['month']==5)&(data['dayofweek']==False)

In [130]:
a = data[tmp_a]['Sales'].mean()
b = data[tmp_b]['Sales'].mean()
print(round(a-b,2))

3010339.1

In [138]:
data = pd.read_csv("C:/Users/SuperUser/Desktop/data/basic2.csv")

In [139]:
data['Date'] = pd.to_datetime(data['Date'])

In [140]:
data['year'] = data['Date'].dt.year
data['month'] = data['Date'].dt.month
data['day'] = data['Date'].dt.day
data.head()

        Date     Sales      PV      UV  Events  year  month  day
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1
1 2022-01-02     36779    3969  2289.0       0  2022      1    2
2 2022-01-03  13943875  373890     NaN       1  2022      1    3
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374  190684     NaN       0  2022      1    5

In [147]:
data['Sales'][data['Events']==1] = data[data['Events']==1]['Sales']*0.8

C:\Users\SuperUser\AppData\Local\Temp\ipykernel_7204\3565616702.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Sales'][data['Events']==1] = data[data['Events']==1]['Sales']*0.8

In [148]:
data.head()

        Date       Sales      PV      UV  Events  year  month  day
0 2022-01-01  18169220.0  397349  4421.0       1  2022      1    1
1 2022-01-02     36779.0    3969  2289.0       0  2022      1    2
2 2022-01-03  11155100.0  373890     NaN       1  2022      1    3
3 2022-01-04   8088593.0  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374.0  190684     NaN       0  2022      1    5

In [153]:
tmp = data.groupby(['year','month'])['Sales'].sum()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [157]:
cond = data['year']==2022
data1 = data[cond]
sale1 = data1.groupby('month')['Sales'].sum().max()
sale1

197145878.0

In [158]:
cond = data['year']==2023
data2 = data[cond]
sale2 = data2.groupby('month')['Sales'].sum().max()
sale2

239619313.8

In [159]:
int(round(abs(sale1 - sale2),0))

42473436